## PRUEBAS CON DATAFRAME DE PANDAS

In [7]:
import numpy as np
import pandas as pd
from pandas import DataFrame
from random import randint

In [2]:
m = np.random.randint(1,50, 30).reshape(5,6)
df1 = DataFrame(m)
df1

    0   1   2   3   4   5
0  29  49  11   6  13  17
1  39  11  28  20  19   1
2  23  25  36  24  49   3
3  40  42   7  31   6  36
4  28  36  45  16  36  45

In [4]:
df1.columns=['a','b','c','d','e','f']
df1

    a   b   c   d   e   f
0  29  49  11   6  13  17
1  39  11  28  20  19   1
2  23  25  36  24  49   3
3  40  42   7  31   6  36
4  28  36  45  16  36  45

In [5]:
d = {"pais":['España','Italia','Alemania'], "hab":[36, 50, 34]}
df2 = DataFrame(d)
df2

       pais  hab
0    España   36
1    Italia   50
2  Alemania   34

In [9]:
d = {i:[randint(1,50) for  _ in range(5)] for i in "hola"}
df3 = DataFrame(d)
df3

    h   o   l   a
0  40  25  38   9
1  32  12  17  44
2  48  38   1  45
3  50  43  32  33
4  45  32   7  45

Acceso a los elementos: filas, columnas o celdas

In [11]:
df3['o']

0    25
1    12
2    38
3    43
4    32
Name: o, dtype: int64